app/views/jobs/index.html.erb

  <% if session[:user_id] %>
  <% user_access = User.find_by(id: session[:user_id]).access %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 9 LIMIT 1

      <div class="panel-group" id="help-nav">
        <% @categories = Category.order(:lft) %>
---
SELECT "categories".* FROM "categories"   ORDER BY "categories"."lft" ASC