app/views/jobs/show.html.erb

<% if session[:user_id] %>
<% user_access = User.find_by(id: session[:user_id]).access %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1

            <% current_user = User.new %>
            <% @questions = Question.where(job_id: @job.id).order(:user_id, created_at: :desc) %>
---
SELECT "questions".* FROM "questions"  WHERE "questions"."job_id" = 93  ORDER BY "questions"."user_id" ASC, "questions"."created_at" DESC

          <% current_user = User.new %>
          <% @bids = Bid.where(job_id: @job.id).order(:user_id, created_at: :desc) %>
---
SELECT "bids".* FROM "bids"  WHERE "bids"."job_id" = 93  ORDER BY "bids"."user_id" ASC, "bids"."created_at" DESC