app/views/jobs/show.html.erb


      <% @bids = Bid.where(job_id: @job.id).order(:user_id, created_at: :desc) %>
---
SELECT "bids".* FROM "bids"  WHERE "bids"."job_id" = 15  ORDER BY "bids"."user_id" ASC, "bids"."created_at" DESC