app/views/home/index.html.erb

SELECT "categories".* FROM "categories"   ORDER BY "categories"."lft" ASC
---

      <% @categories = Category.order(:lft) %>