app/controllers/application_controller.rb

  	def authorize
  		unless User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1