app/controllers/bids_controller.rb

  def create
    @bid = Bid.new(bid_params)
    @bid.user = User.find_by(id: session[:user_id])

    respond_to do |format|
      if @bid.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
INSERT INTO "bids" ("created_at", "description", "image_url", "job_id", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)