app/controllers/categories_controller.rb

  def index
    @categories = Category.order(:rgt)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."rgt" ASC

  def create
    @category = Category.new(category_params)
    if @category.parent_id == nil
      @category.parent_id = @category.id
    end



    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "lft", "parent_id", "rgt", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 18 Mar 2014 01:16:54 UTC +00:00], ["lft", 3], ["parent_id", 5], ["rgt", 4], ["title", "Handy Man - General"], ["updated_at", Tue, 18 Mar 2014 01:16:54 UTC +00:00]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = 2  [["title", "  Handy Man - General"], ["updated_at", Tue, 18 Mar 2014 00:42:06 UTC +00:00]]