app/controllers/documents_controller.rb

  def create
    #current_user = User.find_by(id: session[:user_id])
    @job = Job.find(params[:job_id])

    params[:user_id] = session[:user_id]
    @document = @job.documents.create(document_params)


    @document.save
---
INSERT INTO "documents" ("created_at", "direct_upload_url", "job_id", "updated_at", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "documents" ("created_at", "direct_upload_url", "job_id", "updated_at", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "documents" SET "user_id" = ?, "updated_at" = ? WHERE "documents"."id" = 83