app/controllers/jobs_controller.rb

  def edit
    unless @job.user_id == session[:user_id] || User.find_by(id: session[:user_id]).access == 'administrator'
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def update
    first_document = Document.where(job_id: @job.id).take

    @job.image_url = first_document.upload.url(:thumb)

    if @job.user_id == session[:user_id] || User.find_by(id: session[:user_id]).access == 'administrator'
---
SELECT  "documents".* FROM "documents"  WHERE "documents"."job_id" = ? LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT  "documents".* FROM "documents"  WHERE "documents"."job_id" = 92 LIMIT 1