app/controllers/my_jobs_controller.rb

  def index
  	user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1