app/controllers/questions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def edit
    unless @question.job.user_id == session[:user_id] || User.find_by(id: session[:user_id]).access == 'administrator'

INSERT INTO "questions" ("created_at", "inquiry", "job_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "answer" = ?, "updated_at" = ? WHERE "questions"."id" = 3  [["answer", "No"], ["updated_at", Sun, 23 Mar 2014 22:59:59 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)