app/controllers/users_controller.rb

  def create
    if (not session[:user_id]) || User.find_by(id: session[:user_id]).access == 'administrator'
      @user = User.new(user_params)
      @user.bidder = TRUE
      respond_to do |format|
        if @user.save
---
INSERT INTO "users" ("access", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "avatar_url", "bidder", "created_at", "email", "info", "name", "password_digest", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)