app/views/categories/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  <% if session[:user_id] %>
  <% user_access = User.find_by(id: session[:user_id]).access %>