app/views/layouts/application.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---
            <% if session[:user_id] %>
          		<li><%= link_to User.find_by(id: session[:user_id]).name, User.find_by(id: session[:user_id]) %></li>